<?php

use App\Models\Region;
use Illuminate\Database\Seeder;

class RegionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $regions = [
            [
                'name' => 'Одеська область',
            ],
            [
                'name' => 'Дніпропетровська область'
            ],
            [
                'name' => 'Чернігівська область'
            ],
            [
                'name' => 'Харківська область'
            ],
            [
                'name' => 'Житомирська область'
            ],
            [
                'name' => 'Полтавська область'
            ],
            [
                'name' => 'Херсонська область'
            ],
            [
                'name' => 'Київська область'
            ],
            [
                'name' => 'Запорізька область'
            ],
            [
                'name' => 'Луганська область'
            ],
            [
                'name' => 'Донецька область'
            ],
            [
                'name' => 'Вінницька область'
            ],
            [
                'name' => 'Автономна Республіка Крим'
            ],
            [
                'name' => 'Миколаївська область'
            ],
            [
                'name' => 'Кіровоградська область'
            ],
            [
                'name' => 'Сумська область'
            ],
            [
                'name' => 'Львівська область'
            ],
            [
                'name' => 'Черкаська область'
            ],
            [
                'name' => 'Хмельницька область'
            ],
            [
                'name' => 'Волинська область'
            ],
            [
                'name' => 'Рівненська область'
            ],
            [
                'name' => 'Івано-Франківська область'
            ],
            [
                'name' => 'Тернопільська область'
            ],
            [
                'name' => 'Закарпатська область'
            ],
            [
                'name' => 'Чернівецька область'
            ],
        ];

        foreach ($regions as $region) {
            Region::create($region);
        }
    }
}
